[
  {
    "message": "The Dollar begins a new chapter of growth\n\nThe US dollar is up 0.75% against the euro and 0.5% against a trade-weighted basket of developed country currencies. The euro took a hit after the trade agreement between the EU and the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/wkn13HXfy9aKDCss6"
  },
  {
    "message": "USD/CHF maintains position above 0.8050 as US Dollar advances due to trade optimism\n\nUSD/CHF extends its gains for the second successive session, trading around 0.8060 during the European hours on Tuesday. The pair appreciates as the US Dollar (USD) receives support from trade optimism, driven by the recent trade developments between the United States (US) and its trading...\n\nRead More👈",
    "url": "https://fxstreet.page.link/xFEwuvjVa11QwcJx5"
  },
  {
    "message": "Dollar strength causing markets to fluctuate\n\nImportant News for the day: Tue, 29th, 16:00 CET US JOLTS job openings Dollar building up strength The Dollar starts a potential season with further gains in...\n\nRead More👈",
    "url": "https://fxstreet.page.link/iUco59V89uJPH3H19"
  },
  {
    "message": "EUR/USD bulls take a back seat\n\n EURUSD drifted lower on Monday as investors reacted to the US-EU trade deal and growing concerns that the agreement may be less beneficial for the Eurozone...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ST5qf3Y7VZZr7heB6"
  },
  {
    "message": "Silver Price Forecast: XAG/USD approaches a key support below $38.00\n\nSilver (XAG/USD) is hovering above the $38.00 area for the second consecutive day, consolidating losses after a significant reversal at the end of last week, as strong US macroeconomic data curbed hopes of Fed cuts and boosted support to the US...\n\nRead More👈",
    "url": "https://fxstreet.page.link/dkuZuAuS6CXpHK8u8"
  },
  {
    "message": "US Dollar Index Price Forecast: Advances to near 99.00 after rebounding from 50-day EMA\n\nThe US Dollar Index (DXY), which measures the value of the US Dollar (USD) against six major currencies, is extending its gains for the fourth consecutive session and trading around 98.80 during the European hours on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/gz2mfbyNbQ2zXY5G7"
  },
  {
    "message": "Trump shortens the window for peace deal – ING\n\nICE Brent rallied by more than 2.3% yesterday, pushing prices back above...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/trump-shortens-the-window-for-peace-deal-ing-202507290857?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "DXY. Risks skewed to the upside for now – OCBC\n\nUSD traded better bid overnight. The sell-off in European equities overnight and most Asian equities also weighed on sentiments. DXY was last at 98.83 levels, OCBC's FX analysts Frances Cheung and Christopher Wong...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/dxy-risks-skewed-to-the-upside-for-now-ocbc-202507290901?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "US tariffs hit South Korean exports hard in first half\n\nUS tariffs have had a serious adverse effect on overall South Korean exports, an examination of data...\n\nRead More👈",
    "url": "https://fxstreet.page.link/wrGLeqbMHh51VFDL9"
  },
  {
    "message": "ECB survey: Eurozone Consumer Inflation Expectations fall to 2.6% over next 12 months in June\n\nThe latest monthly Consumer Expectations Survey by the European Central Bank showed on Tuesday that Eurozone inflation is expected to extend its downtrend for the year ahead in...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/ecb-survey-eurozone-consumer-inflation-expectations-fall-to-26-over-next-12-months-in-june-202507290929?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Silver price today: Silver broadly unchanged, according to FXStreet data\n\nSilver prices (XAG/USD) broadly unchanged on Tuesday, according to FXStreet...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/silver-price-today-silver-broadly-unchanged-according-to-fxstreet-data-202507290930?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "EUR/USD under seller control: The deal’s consequences could be severe\n\nThe EUR/USD pair tumbled to 1.1579 by Tuesday, marking its sharpest intraday decline since 6 November last...\n\nRead More👈",
    "url": "https://fxstreet.page.link/X4XJ6hGwUQxPQTQE8"
  },
  {
    "message": "Japan’s Akazawa: Trade deal with US guarantees lowest tariff rates for chips, pharma\n\nJapanese Economy Minister and top trade negotiator Ryosei Akazawa said on Tuesday,  “my understanding is that if a third country reaches an agreement with the United States (US) on lower sectoral tariffs such as chips and pharmaceuticals, the same rate would apply to...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/japans-akazawa-trade-deal-with-us-guarantees-lowest-tariff-rates-for-chips-pharma-202507290946?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "FX markets contemplate US-EU trade deal – Commerzbank\n\nThe trade deal between the US and the EU, announced on Sunday evening, was a major talking point in the markets yesterday, Commerzbank's FX analyst Michael Pfister...\n\nRead More👈",
    "url": "https://fxstreet.page.link/metw6ZQ2DHrHUYqb7"
  },
  {
    "message": "TRY: Lira reacts modestly to positive rating assessments – Commerzbank\n\nTurkey’s economic policy credibility received a modest boost last week as both Moody’s and Fitch offered more positive assessments of macroeconomic...\n\nRead More👈",
    "url": "https://fxstreet.page.link/J4uzejodPzsGh9ey9"
  },
  {
    "message": "AUD/USD bounces up from 0.6500 lows as the US Dollar rally loses steam\n\nThe AUD/USD has found some support at the 0.6500 area, but it remains limited below 0.6530, practically flat on the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/A8RhxwskCUYocHGn9"
  },
  {
    "message": "Gold Price Forecast: XAU/USD struggles around $3,300, on verge of triangle breakdown\n\nGold price (XAU/USD) struggles to gain ground after a four-day sell-off near the round level of $3,300 during the European trading session on...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/gold-price-forecast-xau-usd-struggles-around-3-300-on-verge-of-triangle-breakdown-202507291019?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "GBP/USD: Any further decline is unlikely to reach 1.3300 – UOB Group\n\nConditions are deeply oversold, but there is no clear sign that Pound Sterling (GBP) weakness has stabilised against US Dollar (USD); any further decline is unlikely to reach...\n\nRead More👈",
    "url": "https://fxstreet.page.link/5HNAtBAzThjS21396"
  },
  {
    "message": "GBP/USD Forecast: Pound Sterling remains bearish despite recent rebound\n\nGBP/USD trades slightly above 1.3350 after having touched its weakest level since late May below 1.3320 earlier in the day. The pair's technical picture points to oversold conditions, suggesting that there could be a correction before the next leg...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/gbp-usd-forecast-pound-sterling-remains-bearish-despite-recent-rebound-202507291031?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "AUD/USD: Likely to test 0.6500 – UOB Group\n\nThere is room for Australian Dollar (AUD) to test 0.6500 against US Dollar (USD); a sustained decline below this level is...\n\nRead More👈",
    "url": "https://fxstreet.page.link/XrzJpv8hCytVYkY1A"
  },
  {
    "message": "Qatar threatens to stop LNG supplies to the EU – Commerzbank\n\nMore leeway for LNG deliveries from the US to the EU could be created not only by turning away from Russian gas, but also from other sides, Commerzbank's commodity analyst Barbara Lambrecht...\n\nRead More👈",
    "url": "https://fxstreet.page.link/3KWDY7xzShjofKGT6"
  },
  {
    "message": "NZD/USD might not be able to reach 0.5940 – UOB Group\n\nNew Zealand Dollar (NZD) could decline further against US Dollar (USD), but it might not be able to reach 0.5940. In the longer run, upward momentum has faded; tentative increase in downward momentum may lead to NZD declining to 0.5940, UOB Group’s FX analysts Quek Ser Leang and Peter Chia...\n\nRead More👈",
    "url": "https://fxstreet.page.link/sbo15kjjKiLDJStM8"
  },
  {
    "message": "USD/CAD jumps to near 1.3750, investors await Fed’s and BoC’s monetary policy outcome\n\nThe USD/CAD pair extends its winning streak for the fourth trading day on Tuesday, rising to near...\n\nRead More👈",
    "url": "https://fxstreet.page.link/AkyH33dPp9271zEE7"
  },
  {
    "message": "CAD retains a soft undertone – Scotiabank\n\nThe Canadian Dollar (CAD) is little changed on the session but retains a soft undertone after spending most of the week so far on the back foot against the US Dollar (USD), Scotiabank's Chief FX Strategists Shaun Osborne and Eric Theoret...\n\nRead More👈",
    "url": "https://fxstreet.page.link/c2PJ3WZXMS5HHEi96"
  },
  {
    "message": "EUR steady following Monday’s drop – Scotiabank\n\nThe Euro (EUR) is attempting stabilization in the mid/-upper 1.15s as it seeks to  consolidate Monday’s sizeable 1.3% decline against the US Dollar (USD), Scotiabank's Chief FX Strategists Shaun Osborne and Eric Theoret...\n\nRead More👈",
    "url": "https://fxstreet.page.link/7inJxFT79WRx52ZE8"
  },
  {
    "message": "JPY quiet at range low ahead of BoJ later in week – Scotiabank\n\nThe Japanese Yen (JPY) is entering Tuesday’s NA session unchanged against the US Dollar (USD) as it consolidates its recent decline to the lower end of its multi-month range, Scotiabank's Chief FX Strategists Shaun Osborne and Eric Theoret...\n\nRead More👈",
    "url": "https://fxstreet.page.link/nwdkMBKSMTNNM5Ak7"
  },
  {
    "message": "The commodities feed: Risk of additional Russia tariffs unnerves market\n\nOil prices rallied after President Trump said he would shorten the deadline for Russia to come to a deal with Ukraine to end the war, raising supply...\n\nRead More👈",
    "url": "https://fxstreet.page.link/S3oqRWkP2L5dnLmJ6"
  },
  {
    "message": "US Dollar extends trade-driven rally as markets await key US economic data\n\nThe US Dollar (USD) is holding firm on Tuesday after posting its strongest single-day gain since May, rallying 1.0% on Monday. The rally came after the United States (US) and European Union (EU) announced a major trade deal framework on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/MqsRHACS3mihwAoz5"
  },
  {
    "message": "EUR/USD and USD/CAD technical outlook: Potential reversals and key levels\n\nAfter a relatively calm summer, the foreign exchange market has been jolted by a significant surge in the US dollar index (DXY)—its best day since early...\n\nRead More👈",
    "url": "https://fxstreet.page.link/1xVS8uEeewppx6dg9"
  },
  {
    "message": "Dollar short-squeeze extended before stalling ahead of tomorrow's key events\n\nOverview: The short-covering recovery in the US dollar has been extended today but the momentum stalled in the European morning. The key issue is whether North American participants can extend...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/dollar-short-squeeze-extended-before-stalling-ahead-of-tomorrows-key-events-202507291234?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "The Fed is likely to pave the way for a rate cut in September\n\nThe central event of the current week is the Fed meeting, which has the potential to create significant market movement and set the tone for the coming...\n\nRead More👈",
    "url": "https://fxstreet.page.link/LXjYBAdZ1WyATGRW9"
  },
  {
    "message": "The important mover and shaker will be how many Fed side with the doves tomorrow\n\nWe get a ton of releases today, some expected to be quite grim (housing) and some others probably pretty good...\n\nRead More👈",
    "url": "https://fxstreet.page.link/uCYcZiyvCiAvGyce7"
  },
  {
    "message": "Rising wedge and Monday’s decline\n\nS&P 500 pushed a bit higher following the bullish opening gap called, and then pulled back not only during the regular session – it pulled back almost all the way till the closing...\n\nRead More👈",
    "url": "https://fxstreet.page.link/izQJjW7ArKCviS458"
  },
  {
    "message": "Dissent is in the air' ahead of Fed meeting\n\nThe vote on rates may not be a unanimous one, however, with members Waller and Bowman (who were both appointed by Trump during his first stint in the White House), voicing a preference for a July...\n\nRead More👈",
    "url": "https://fxstreet.page.link/FYVjE6cNJp6JNEve8"
  },
  {
    "message": "Gold outlook: Fed decision and trade talks on the menu\n\nSince our last report Gold’s price has moved lower. In today’s report we are to discuss mainly fundamental issues and we intend to end the report with a technical analysis of Gold’s daily...\n\nRead More👈",
    "url": "https://fxstreet.page.link/xyFPGvDjJyaAnYAV6"
  },
  {
    "message": "Lutnick: Deals are on the table for Trump to consider\n\nUS Commerce chief Howard Lutnick stated on Tuesday that President Trump is set to make his trade deal decisions this week, despite ongoing negotiations with China and the European Union, ahead of the August 1...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/lutnick-deals-are-on-the-table-for-trump-to-consider-202507291324?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Bandwidth (BAND) beats Q2 earnings and revenue estimates\n\nBandwidth came out with quarterly earnings of $0.38 per share, beating the Zacks Consensus Estimate of $0.32 per...\n\nRead More👈",
    "url": "https://fxstreet.page.link/4xie3EMRdy79JCXn8"
  },
  {
    "message": "Is Upstart Holdings (UPST) ready for the next big rally in 2025-26?\n\nUpstart Holdings, Inc., (UPST) operates a cloud-based artificial intelligence (AI) lending platform in the United States. The company operates through three segments: Personal lending, Auto lending & others. It comes under Financial services sector and trades as “UPST” ticker at...\n\nRead More👈",
    "url": "https://fxstreet.page.link/PdDeH9NeqnCrR4ug9"
  },
  {
    "message": "Netflix Inc. $NFLX blue box area offers a buying opportunity\n\nIn today’s article, we’ll examine the recent performance of Netflix Inc. ($NFLX) through the lens of Elliott Wave Theory. We’ll review how the decline from the June 30, 2025, high unfolded as a 7-swing correction (WXY) and discuss our forecast for the next...\n\nRead More👈",
    "url": "https://fxstreet.page.link/g91H7wfTXp9J2azeA"
  },
  {
    "message": "XLF reaches new heights: Blue box area proves pivotal\n\nIn this technical blog, we will look at the past performance of the 1-hour Elliott Wave Charts of XLF. We presented to members at the elliottwave-forecast. In which, the rally from the 07 April 2025 low is unfolding as an...\n\nRead More👈",
    "url": "https://fxstreet.page.link/BvCQa5pTH3asGT6D8"
  },
  {
    "message": "US CB Consumer Confidence Index rose to 97.2 in July\n\nUS consumer sentiment picked up extra pace in July, as the Conference Board’s Consumer Confidence Index increased to 97.2 from a revised 95.2, adding to the previous...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Sch637579YGitSFC9"
  },
  {
    "message": "Breaking: US JOLTS Job Openings decline to 7.43 million in June vs. 7.55 million forecast\n\nThe number of job openings on the last business day of June stood at 7.43 million, the US Bureau of Labor Statistics (BLS) reported in the Job Openings and Labor Turnover Survey (JOLTS) on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/AAmfuB3pRjvnF2J48"
  },
  {
    "message": "Spirits stirring: ASI shows signs of life\n\nThe Animal Spirits Index (ASI) returned to positive territory in June (0.09) after three consecutive months of negative...\n\nRead More👈",
    "url": "https://fxstreet.page.link/c1XcAo7YfJBdd1Z76"
  },
  {
    "message": "Euro extends losses as US-EU trade pact fuels US Dollar demand, Fed decision in focus\n\nThe Euro (EUR) edges lower for the second straight day against the US Dollar (USD) on Tuesday, as the Greenback extended its rally following the US-EU trade agreement, which has faced heavy criticism across Europe for being one-sided and heavily skewed in favor of the United States...\n\nRead More👈",
    "url": "https://fxstreet.page.link/X5JgVyQj3G9uXVqp6"
  },
  {
    "message": "The US trade deficit has stopped pressuring the dollar\n\nDue to a decline in imports, the US trade deficit narrowed in June to $86 billion, down from $96.4 billion a month earlier and a peak of $162 billion in...\n\nRead More👈",
    "url": "https://fxstreet.page.link/oK3z6TAoW3UBNzpr8"
  },
  {
    "message": "USD Index outlook: Dollar continues to trend higher as sentiment brightens after US-EU trade deal\n\nThe dollar index keeps firm tone and rallies to new five-week high on Tuesday, in extension of Monday’s 1.1% advance (the biggest one-day gain since May...\n\nRead More👈",
    "url": "https://fxstreet.page.link/isHhH6iP1xeW83nAA"
  },
  {
    "message": "AUD/USD Price Forecast: The 200-day SMA holds the downside, for now\n\nThe Australian Dollar (AUD) extended Monday’s pessimism, much like its other risk‑sensitive peers, dragging AUD/USD below the 0.6500 support and reaching multi-day troughs amid the persistent rebound in the US Dollar...\n\nRead More👈",
    "url": "https://fxstreet.page.link/DM8WGHUVubPsyn1H7"
  },
  {
    "message": "UnitedHealth stock spirals after missing quarterly EPS, lowering 2025 guidance\n\nUnitedHealth Group (UNH) stock sank over 5% on Tuesday after the largest health insurer in the US missed Wall Street's already lowered estimate for the second quarter. The Minnesota-based company reported adjusted earnings per share of $4.08, which was more than 8% off the $4.45 consensus...\n\nRead More👈",
    "url": "https://fxstreet.page.link/9P2mVaSwNMSBQr766"
  },
  {
    "message": "Gold Price Forecast: XAU/USD stable as Federal Reserve’s decision looms\n\nSpot Gold saw little action on Tuesday, holding within Monday’s range. The XAU/USD pair hovers around $3,320 during US trading hours, having found buyers on dips towards the $3,300 price...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/gold-price-forecast-xau-usd-stable-as-federal-reserves-decision-looms-202507291720?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Canadian Dollar continues to slide ahead of Fed rate call\n\nThe Canadian Dollar (CAD) extended into a fourth straight day of losses against the US Dollar (USD) on Tuesday, continuing a Greenback-positive theme in the run-up to the latest interest rate call from the Federal Reserve...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Pwp31RdxWEKNnHW59"
  },
  {
    "message": "Is the Semiconductor Index topping out?\n\nIn our previous update from July 1, we showed that the Elliott Wave (EW) Principle for the Semiconductor Index (SOX) accurately predicted the index’s “up->down->up” pattern two weeks in advance, showcasing the strength and validity of the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/AUjk2N3MNbC8FBgE7"
  },
  {
    "message": "EUR/USD Price Forecast: Next on the downside comes 1.1450\n\nThe Euro’s (EUR) slide picked up pace on Tuesday, as EUR/USD slipped to multi-week troughs in the 1.1520-1.1510 band, fuelled by the intense US Dollar strength that pushed the US Dollar Index (DXY) back above the 99.00...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/eur-usd-price-forecast-next-on-the-downside-comes-11450-202507291809?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Forex Today: The Fed is largely expected to stand pat\n\nThe US Dollar (USD) extended further its march north on Tuesday, reaching new multi-week highs on the back of rising scepticism surrounding the trade scenario, while investors geared up for the imminent interest rate decision by the Federal Reserve and, later in the week, the publication of the...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/forex-today-the-fed-is-largely-expected-to-stand-pat-202507291840?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "AUD/USD steadies above 0.6500 as traders eye Australia CPI, Fed decision\n\nThe Australian Dollar (AUD) stays under pressure for the fourth day in a row against the US Dollar (USD) on Tuesday, as the Greenback continues to gain...\n\nRead More👈",
    "url": "https://fxstreet.page.link/4YJtqg1Z7enSpYvaA"
  },
  {
    "message": "US Treasury Secretary Scott Bessent: Not the end of the world if tariffs snap back\n\nUnited States (US) Treasury Secretary Scott Bessent hit newswires on Tuesday following the conclusion of the latest round of trade talks between the US and...\n\nRead More👈",
    "url": "https://fxstreet.page.link/1wsVtiiVWMUBxMVw8"
  },
  {
    "message": "S&P hits the pause button as trade tailwinds fade and the Fed looms\n\nThe S&P 500 took a breather on Tuesday—just after tagging fresh highs on the open—as traders caught their breath ahead of a trifecta of macro hurdles: Fed day, a data deluge, and the Friday jobs...\n\nRead More👈",
    "url": "https://fxstreet.page.link/AYLoxxLJHDQum94t7"
  },
  {
    "message": "Australian CPI expected to remain stable for June\n\nAustralia will release inflation updates on Wednesday, two weeks ahead of the Reserve Bank of Australia (RBA) monetary policy meeting, scheduled for August...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Q1fYSab4Qkn4YXfV7"
  },
  {
    "message": "Gold struggling to break through\n\nTrend bias: Gold (XAUUSD) is in the middle of a triangle pattern, currently in wave...\n\nRead More👈",
    "url": "https://fxstreet.page.link/hyqDhxsuKe38cG8y6"
  },
  {
    "message": "Gold rebounds to $3,330 as US yields fall, JOLTS miss boosts bullion bid\n\nGold price recovered some ground on Tuesday after falling for the fourth straight day as the Greenback trimmed some of its earlier gains, which boosted appetite for the yellow...\n\nRead More👈",
    "url": "https://fxstreet.page.link/VFxjyKwB4cuBSJV6A"
  },
  {
    "message": "USD/CAD holds steady above 1.3750 ahead of BoC, Fed rate decisions\n\nThe USD/CAD pair trades on a flat note near 1.3770 during the early Asian session on Wednesday. Markets might turn cautious later in the day as traders brace for the imminent interest rate decision by the Bank of Canada (BoC) and the US Federal Reserve...\n\nRead More👈",
    "url": "https://fxstreet.page.link/cBGqNSP81xrqVBcg9"
  },
  {
    "message": "GBP/USD finds bottom ahead of key Fed rate call\n\nGBP/USD found some balance on Tuesday, pumping the brakes on an extended backslide but falling just short of snapping its losing...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/gbp-usd-finds-bottom-ahead-of-key-fed-rate-call-202507292342?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "EUR/USD extends selloff to 1.1550 as Dollar strengthens despite weak US data\n\nThe EUR/USD resumed its downtrend for the second straight day as market participants digest softer-than-expected economic data from the United States...\n\nRead More👈",
    "url": "https://fxstreet.page.link/C15bKktUaTpabjri7"
  },
  {
    "message": "China's Finance Minister signals more proactive fiscal support amid rising uncertainty\n\nChina’s Finance Minister Lan Fo’an said on Tuesday that the country will ramp up fiscal support to bolster domestic consumption and mitigate mounting economic...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ZLUN7xVnSKWtzeZk6"
  },
  {
    "message": "WTI climbs above $68.50 as Trump raises pressure on Russia\n\nWest Texas Intermediate (WTI), the US crude oil benchmark, is trading around $68.75 during the Asian trading hours on Wednesday. The WTI climbs to the highest levels in over a month amid growing concerns over global supply...\n\nRead More👈",
    "url": "https://fxstreet.page.link/VYJfvLLCox6yPYgs8"
  },
  {
    "message": "PBOC sets USD/CNY reference rate at 7.1441 vs. 7.1511 previous\n\n On Wednesday, the People’s Bank of China (PBOC) set the USD/CNY central rate for the trading session ahead at 7.1441 as compared to the previous day's fix of...\n\nRead More👈",
    "url": "https://fxstreet.page.link/quFGhaQFzrWrN7yk9"
  },
  {
    "message": "Breaking: Australia’s CPI inflation declines to 0.7% QoQ in Q2 vs. 0.8% expected\n\nAustralia’s Consumer Price Index (CPI) rose 0.7% QoQ in the second quarter (Q2) of 2025, compared with the 0.9% increase seen in the first quarter, according to the latest data published by the Australian Bureau of Statistics (ABS) on...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/australian-cpi-expected-to-remain-stable-for-june-202507292130?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Nasdaq futures stumble at channel ceiling, bulls rally to defend mid‑channel pivot\n\nHolding 23,432 is critical for a relief rally toward 23,545; failure risks a deeper slide into the 23,385–23,327 support...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Wz3eFtAGJjNCHqnx8"
  },
  {
    "message": "Breaking: Australia’s CPI inflation drops to 0.7% QoQ in Q2 vs. 0.8% expected\n\nAustralia’s Consumer Price Index (CPI) rose 0.7% QoQ in the second quarter (Q2) of 2025, compared with the 0.9% increase seen in the first quarter, according to the latest data published by the Australian Bureau of Statistics (ABS) on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/erDzxRxH65YS1pWN9"
  },
  {
    "message": "Australian Dollar strengthens despite weaker inflation data\n\nThe Australian Dollar (AUD) appreciates against the US Dollar (USD) on Wednesday, halting its four-day losing...\n\nRead More👈",
    "url": "https://fxstreet.page.link/FmXvfQf7QM9Mu32cA"
  },
  {
    "message": "AUD/JPY weakens to near 96.50 on softer Australian CPI inflation data\n\nThe AUD/JPY cross edges lower to near 96.50 during the Asian trading hours on Wednesday. The Australian Dollar (AUD) weakens against the Japanese Yen (JPY) after the softer-than-expected Australian inflation...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Xg4wX3ze4GYfmjKU8"
  },
  {
    "message": "US Dollar Index remains below 99.00 ahead of Fed policy decision\n\nThe US Dollar Index (DXY), which measures the value of the US Dollar (USD) against six major currencies, is halting its four-day winning streak and trading around 98.80 during the Asian hours on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/siSX7mhZPyTyEEUx8"
  },
  {
    "message": "Gold price consolidates in $3,320-3,330 band; looks to Fed for meaningful impetus\n\nGold price (XAU/USD) seesaws between tepid gains/minor losses during the Asian session on Wednesday, warranting some caution before positioning for an extension of this week's bounce from the $3,300...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/gold-price-consolidates-in-3-320-3-330-band-looks-to-fed-for-meaningful-impetus-202507300406?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "EUR/USD holds positive ground above 1.1550, all eyes on Fed rate decision\n\nThe EUR/USD pair gains ground to near 1.1560, snapping the four-day losing streak during the Asian trading hours on Wednesday. However, the potential upside for the major pair might be limited ahead of the crucial US...\n\nRead More👈",
    "url": "https://fxstreet.page.link/PzPjoEYCoz2yNNLE9"
  },
  {
    "message": "India Gold price today: Gold steadies, according to FXStreet data\n\nGold prices remained broadly unchanged in India on Wednesday, according to data compiled by...\n\nRead More👈",
    "url": "https://fxstreet.page.link/qL4TTPzmw9LcPQv26"
  },
  {
    "message": "USD/INR advances as Trump signals higher import duty on India\n\nThe Indian Rupee (INR) extends its downside against the US Dollar (USD) at open on Wednesday, sliding to near...\n\nRead More👈",
    "url": "https://fxstreet.page.link/mDbkifbqdSagqdKc9"
  },
  {
    "message": "Gold Price Forecast: XAU/USD remains stuck in a familiar range as US GDP, Fed loom\n\nGold price is treading water while below the critical resistance of $3,345 early Wednesday as traders opt to remain on the sidelines ahead of the all-important US Federal Reserve (Fed) monetary policy...\n\nRead More👈",
    "url": "https://fxstreet.page.link/xcw21q4T1Zx67HTz9"
  },
  {
    "message": "Three days, eight dice rolls and one market crossroads\n\nWall Street’s walking into a three-day meat grinder—GDP, the Fed, payrolls, and four of the world’s most systemically important stocks all crowding into the same narrow macro...\n\nRead More👈",
    "url": "https://fxstreet.page.link/STcsLAx2hs3u1EgeA"
  },
  {
    "message": "USD/CHF drifts lower to near 0.8050 as traders brace for Fed rate decision\n\nThe USD/CHF pair trades in negative territory around 0.8055 during the early European session on Wednesday. Markets turn cautious ahead of the US Federal Reserve (Fed) interest rate decision and the US tariff...\n\nRead More👈",
    "url": "https://fxstreet.page.link/v91PVcjXz8Vb3eVh9"
  },
  {
    "message": "US Fed, BoJ, BoC rates in focus, along with corp EPS incl MSFT, META, AAPL, AMZN\n\nAsia market update: Massive Pacific earthquake and attendant tsunami warnings intercede in Asia prior to busy 24 hour data period; US Fed, BOJ, BOC rates in focus, along with corp EPS incl MSFT, META, AAPL,...\n\nRead More👈",
    "url": "https://fxstreet.page.link/B5toX54FVonjPr9T6"
  },
  {
    "message": "German Retail Sales rise 4.9% YoY in June vs. 1.6% previous\n\nRetail Sales in Germany rose 1.0% month-over-month (MoM) in June, following the revised 1.6% decline reported in May, according to official data released by Destatis on Wednesday.The market forecast was for a 0.5% increase.On an annual basis, Retail Sales rose 4.9% in June vs. May’s 1.6%...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/german-retail-sales-rise-49-yoy-in-june-vs-16-previous-202507300601?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Crude Oil price today: WTI price bearish at European opening\n\nWest Texas Intermediate (WTI) Oil price falls on Wednesday, early in the European session. WTI trades at $68.72 per barrel, down from Tuesday’s close at $68.91.Brent Oil Exchange Rate (Brent crude) is also shedding ground, trading at $71.56 after its previous daily close at...\n\nRead More👈",
    "url": "https://fxstreet.page.link/apGntGKCVyNDH2Tn8"
  },
  {
    "message": "China's Politburo says economic foundation is stable\n\nChina’s Politburo held its latest meeting, with the key takeaways noted...\n\nRead More👈",
    "url": "https://fxstreet.page.link/p8BtXKZCL2UMgHcJ8"
  },
  {
    "message": "RBA holds rates amid inflation surprise – Oil surges on geopolitical tensions\n\nYesterday’s first batch of US economic data wasn’t exactly groundbreaking. JOLTS job openings in June came in close to expectations with 7.43mln, easing from the 7.71mln in May while the July Conference Board’s consumer confidence indicator improved a bit more than expected from 95.2 to...\n\nRead More👈",
    "url": "https://fxstreet.page.link/uCmHZVsbdzgs45Ng8"
  },
  {
    "message": "EUR/GBP softens to near 0.8650 after German Retail Sales data\n\nThe EUR/GBP cross trades on a negative note near 0.8650 during the early European session on Wednesday. The Euro (EUR) weakens against the Pound Sterling (GBP) despite the upbeat German economic...\n\nRead More👈",
    "url": "https://fxstreet.page.link/qyKQbiA1wejtQGQj6"
  },
  {
    "message": "Gold ready to trade higher today\n\nGold made a high for the day exactly at resistance at 3330/3335 & traded down to 3322 but there was only this 100 tick profit offered on shorts.I think we will break higher today - so a break above 3337 is a buy signal targeting resistance at...\n\nRead More👈",
    "url": "https://fxstreet.page.link/3Em5Qim9oAMUZySo8"
  },
  {
    "message": "Divergence on the menu?\n\nThe market is tuning back into the age-old rhythm of divergence—growth divergence, yield divergence, and now, political divergence. With whispers of a 3.3% US GDP print echoing through the streets, EUR/USD feels like it’s walking the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/gw22Mx2Vi2tWYSqq6"
  },
  {
    "message": "WTI holds near $69.00, five-week highs, following Trump’s renewed threat to Russia\n\nWest Texas Intermediate (WTI) Oil price steadies after registering gains in the previous two successive sessions, trading around $68.90 per barrel during the early European hours on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/XYsJ6Q3HUU28LMYN7"
  },
  {
    "message": "Pound Sterling trades with caution against US Dollar ahead of Fed interest rate decision\n\nThe Pound Sterling (GBP) trades cautiously near 1.3350 against the US Dollar (USD) during the European trading session on Wednesday as investors await the Federal Reserve’s (Fed) monetary policy announcement at 18:00...\n\nRead More👈",
    "url": "https://fxstreet.page.link/KNPaSy5V7pHjMXkY6"
  },
  {
    "message": "Dollar pauses ahead of Fed amid rising policy and geopolitical tensions\n\nThe US dollar paused its upward momentum on Wednesday after a four-day winning streak, trading just below the 99.00 level as global markets entered a cautious holding pattern ahead of the Federal Reserve’s policy...\n\nRead More👈",
    "url": "https://fxstreet.page.link/kRzWeQr56VC7tMYL8"
  },
  {
    "message": "NZD/USD picks up above 0.5950 as the US Dollar eases ahead of the Fed \n\nThe New Zealand Dollar is showing a mild recovery attempt against its US counterpart, trimming losses after a four-day losing st¡treak, as investors brace for the US Federal Reserve’s monetary policy decision due later today.The Kiwi picked up from 0.5945 lows but remains trapped within Tuesday’s...\n\nRead More👈",
    "url": "https://fxstreet.page.link/NLQWJV9E5FsupjUF8"
  },
  {
    "message": "EUR/JPY remains subdued near 171.00 as German economy contracts in Q2, Eurozone GDP eyed\n\nEUR/JPY extends its losses for the third successive session, trading around 171.10 during the European hours on Wednesday. The currency cross holds losses following key economic data from Germany, the largest economy in the Eurozone. Traders shift their focus toward Eurozone GDP...\n\nRead More👈",
    "url": "https://fxstreet.page.link/SEuAi36Rvm5TqfGQ9"
  },
  {
    "message": "DXY: FOMC and data – OCBC\n\nUS Dollar (USD) strength moderated overnight, following the pullback in UST yields. DXY was last at 98.82 levels, OCBC's FX analysts Frances Cheung and Christopher Wong...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/dxy-fomc-and-data-ocbc-202507300833?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "CAD: Dovish risks today – ING\n\nThe Canadian Dollar (CAD) has dropped less than other G10 currencies during this round of US Dollar (USD)...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Kw6EBGGsuC4tfHus9"
  },
  {
    "message": "USD/CAD Price Forecast: Bulls pause for a breather ahead of us data, BOC/Fed decisions\n\nThe USD/CAD pair enters a bullish consolidation phase on Wednesday and oscillates in a range just below a five-week high set the previous day as traders opt to move to the sidelines ahead of key central bank...\n\nRead More👈",
    "url": "https://fxstreet.page.link/XX1m6kJ1FfRLWnuPA"
  },
  {
    "message": "BoC set to leave interest rate unchanged amid what some consider the end of cutting cycle\n\nAs the Bank of Canada (BoC) gets set to issue a new interest rate decision on Wednesday, July 30, there is a growing sense that the cutting cycle might have already...\n\nRead More👈",
    "url": "https://fxstreet.page.link/vmxLhznLtpJDzDBu5"
  },
  {
    "message": "USD/CAD eyes 1.3800 break as momentum builds – Société Générale\n\nUSD/CAD is approaching key resistance at 1.3800 after consolidating gains from its June low near 1.3535. With momentum turning more constructive, a breakout could open the door to 1.3910 and the 200-DMA near 1.4000, Société Générale's FX analysts...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/usd-cad-eyes-13800-break-as-momentum-builds-societe-generale-202507300904?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "USD/JPY in correction as markets await signals from Fed and BoJ\n\nThe USD/JPY pair fell to 147.92 on Wednesday, with the Japanese yen recovering some of its early-week losses as the US dollar softened ahead of the Federal Reserve’s policy...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Uqv7uvwTQg9kf4Ni6"
  },
  {
    "message": "AUD: Good enough – Commerzbank\n\nIn the minutes of the last meeting of the Reserve Bank of Australia, the monetary policy committee highlighted two economic factors in particular that will influence the interest rate decision at the next meeting in August: the labour market and...\n\nRead More👈",
    "url": "https://fxstreet.page.link/UrjVxBNa6DMu92tf7"
  },
  {
    "message": "Silver price today: Silver falls, according to FXStreet data\n\nSilver prices (XAG/USD) fell on Wednesday, according to FXStreet...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ccEbbvpds43xNjk87"
  },
  {
    "message": "AUD/USD: Signs of building downward momentum – UOB Group\n\nAustralian Dollar (AUD) is likely to trade in a range between 0.6500 and 0.6540 against US Dollar...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/aud-usd-signs-of-building-downward-momentum-uob-group-202507300942?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Gold price holds steady ahead of Fed decision and US economic data\n\nGold (XAUUSD) prices are trading cautiously as investors await critical...\n\nRead More👈",
    "url": "https://fxstreet.page.link/X4HZV2ZTPXms2f4N8"
  },
  {
    "message": "Federal Reserve set to leave interest rates unchanged as uncertainty clouds economic outlook\n\nThe United States (US) Federal Reserve (Fed) will announce its interest rate decision and publish the policy statement following the July policy meeting on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/qHUBH9qZM768y6GFA"
  },
  {
    "message": "WTI Oil outlook: Bulls pause under cloud top after strong advance in past two days\n\nWTI oil price eases from new five-week high on Wednesday after advancing over 6% in past two...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Zhg9HZKxRjWzjrsB6"
  },
  {
    "message": "USD/JPY has a chance to rise toward 149.20 – UOB Group\n\nThe current price movements are likely part of a 147.85/148.75 consolidation phase. In the longer run, price action indicates that USD could rise toward 149.20, UOB Group's FX analysts Quek Ser Leang and Peter Chia...\n\nRead More👈",
    "url": "https://fxstreet.page.link/iTNAAKC83h2iWw5H9"
  },
  {
    "message": "USD/CNH must close above 7.1910 for a continued advance – UOB Group\n\nUpward momentum is building, but for a continued advance, US Dollar (USD) must first close above 7.1910, UOB Group's FX analysts Quek Ser Leang and Peter Chia...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ygBD35qtm2mz4FvBA"
  },
  {
    "message": "GBP/USD Forecast: Pound Sterling recovery to remain shallow ahead of Fed\n\nAfter touching its lowest level since mid-May near 1.3300 on Tuesday, GBP/USD stages a correction and trades above 1.3350 in the European session on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/xmBYWv9RM1Tz73J29"
  },
  {
    "message": "FOMC day\n\nUSD: Sept '25 is Down at 98.605. Energies: Aug '25 Crude is Down at...\n\nRead More👈",
    "url": "https://fxstreet.page.link/bFFP5muhn7bnjqB77"
  },
  {
    "message": "Small growth for Eurozone economy already better than expected\n\nThe 0.1% growth compared to the first quarter shows resilience despite US trade volatility. While short-term risks to the outlook remain high, improvements in sentiment provide encouraging signs for the coming quarters as economic uncertainty hopefully...\n\nRead More👈",
    "url": "https://fxstreet.page.link/HjkFdSfEnATf9K6z8"
  },
  {
    "message": "Fed rate in focus: What investors are watching today\n\nThe Federal Reserve is unlikely to cut rates this week despite Trump’s...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Di6L4zZ8FuQ3XdNs8"
  },
  {
    "message": "Dow Jones futures edge higher ahead of Fed policy, Q2 GDP and tech earnings\n\nDow Jones futures tick up during the European trading session on Wednesday. The 30-stocks basket edges higher after a two-day decline, with investors awaiting the outcome of the Federal Reserve’s (Fed) monetary policy meeting at 18:00...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/dow-jones-futures-edge-higher-ahead-of-fed-policy-q2-gdp-and-tech-earnings-202507301142?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Gold Price Forecast: XAU/USD remains bearish, with $3,345 likely to hold bulls  \n\nGold (XAU/USD) is moving higher on Wednesday, favoured by a somewhat softer US Dollar, as investors trim their recent USD long positions ahead of the US Preliminary GDP release and the Fed monetary policy decision, due later...\n\nRead More👈",
    "url": "https://fxstreet.page.link/6WiUwGePFU96yBGU7"
  },
  {
    "message": "Fed to rebel against Trump but 'in a tough spot' over future policy easing\n\nFollowing the unveiling of Trump’s tariffs on 2nd April, markets were quick to price in a more aggressive pace of US rate cuts in 2025 amid speculation that the trade restrictions would trigger a slowdown in the world’s largest...\n\nRead More👈",
    "url": "https://fxstreet.page.link/3YkGZTJp2cDJqfZJ7"
  },
  {
    "message": "US private sector employment rises 104,000 in July vs. 78,000 expected\n\nPrivate sector employment in the US rose by 104,000 in July, the Automatic Data Processing (ADP) reported on Wednesday. This reading followed the 23,000 decrease (revised from -33,000) recorded in June and came in better than the market expectation for an increase of...\n\nRead More👈",
    "url": "https://fxstreet.page.link/WeorphQwnhmbkHss7"
  },
  {
    "message": "Breaking: US GDP grows at an annual rate of 3% in Q2 vs. 2.4% forecast\n\nThe United States' Gross Domestic Product expanded at an annual rate of 3% in the second quarter, the US Bureau of Economic Analysis' (BEA) first estimate showed on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/7zEdg6Hsczt4Qxyv6"
  },
  {
    "message": "CTAs poised to rebuild Gold longs – TDS\n\nGold appears to have entered a consolidation phase following a period of heavy selling. With CTAs now skewed toward buying, ETF outflows reversing, and macro funds still short, the market setup favors a renewed uptrend in the near term, TDS' Senior Commodity Strategist Daniel Ghali...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ZK9He1gJTXHzdmhN9"
  },
  {
    "message": "EUR/USD Price Forecast: US Dollar runs on upbeat data\n\nThe EUR/USD pair fell below the 1.1500 level early in the American session, with demand for the US Dollar (USD) boosted by upbeat United States (US)...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/eur-usd-price-forecast-us-dollar-runs-on-upbeat-data-202507301258?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "EUR/USD tumbles to multi-week low as robust US data fuels US Dollar rally\n\nThe Euro (EUR) is on the back foot for a fifth straight day against the US Dollar on Wednesday, weighed down by a stronger Greenback and ongoing concerns over the recently announced US-EU trade deal, which many investors see as skewed in Washington’s...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ouqjzvzZzCm69rwu5"
  },
  {
    "message": "GBP/USD Elliott Wave insight: Bounce should fail into support zone [Video]\n\nThe GBP/USD is trading in higher high sequence from 9.22.2022 low in weekly. The bounce is corrective Elliott Wave sequence & expect further upside. It favors pullback in proposed 7 swings from 7.01.2025 high & extend into 1.3162 – 1.2898 area, while below 7.23.2025...\n\nRead More👈",
    "url": "https://fxstreet.page.link/ZebadgYxQ7zPUGZaA"
  },
  {
    "message": "GBP/USD pierces 1.3300 on US data, Fed takes the spotlight \n\nThe GBP/USD pair shed over 60 pips early in the American session on Wednesday and defies the 1.3300 figure, as investors weigh better-than-expected United States (US) data. The Sterling Pound (GBP) held ground throughout the first half of the day, but capitulated to broad US Dollar (USD)...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Yd4Ji8pbJcdKBUv9A"
  },
  {
    "message": "Advanced Micro Devices ( AMD) stock rallies from the blue box area\n\n. In this technical article, we are going to present Elliott Wave trading setup of...\n\nRead More👈",
    "url": "https://fxstreet.page.link/J2MfFGPg87EdcWhy5"
  },
  {
    "message": "The US private sector is showing signs of health, spurring the Dollar's recovery\n\nPrivate sector employment data released by ADP showed an increase of 104K jobs in July after a decline of 23K previously (revised from -33K) – better than expected and a noticeable improvement compared to the previous...\n\nRead More👈",
    "url": "https://fxstreet.page.link/tJhnDNBQQJsD3df48"
  },
  {
    "message": "USD/JPY climbs to 149.00 on upbeat US data\n\nFollowing the bearish action seen earlier in the day, USD/JPY regains its traction and trades at a fresh two-week high at around 149.00 in the American session on...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/usd-jpy-climbs-to-14900-on-upbeat-us-data-202507301344?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Breaking: Bank of Canada stands pat in July\n\nIn line with market analysts’ expectations, the Bank of Canada held its policy rate steady at 2.75% on...\n\nRead More👈",
    "url": "https://fxstreet.page.link/kRoF134AgBSaK8y18"
  },
  {
    "message": "Watsco (WSO) Q2 earnings and revenues miss estimates\n\nWatsco came out with quarterly earnings of $4.52 per share, missing the Zacks Consensus Estimate of $4.84 per...\n\nRead More👈",
    "url": "https://fxstreet.page.link/LYoeN6doYTuM2Tnf6"
  },
  {
    "message": "President Trump: The Fed must now lower the rate\n\nPresident Donald Trump renewed his call on Wednesday for the Federal Reserve to cut interest rates, citing stronger‑than‑expected US economic growth in the April-June period...\n\nRead More👈",
    "url": "https://fxstreet.page.link/xvzRS8GvRozfwTSM8"
  },
  {
    "message": "EUR/USD to move higher on a 6-to-12-month view – Rabobank\n\nEUR/USD is struggling to regain its composure after Monday’s plunge. EUR/USD has been ripe for some correction, though our 3-month forecast of 1.15 has already been tested...\n\nRead More👈",
    "url": "https://fxstreet.page.link/BFWNcG6ExAL669E89"
  },
  {
    "message": "Canadian Dollar extends losses as BoC holds rates amid inflation concerns and trade risks\n\nThe Canadian Dollar (CAD) extends losses for the fifth consecutive session against the US Dollar (USD) on Wednesday, as the Greenback continues its broad-based rally following stronger-than-expected US economic...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/canadian-dollar-extends-losses-as-boc-holds-rates-amid-inflation-concerns-and-trade-risks-202507301420?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Fed stays cautious as S&P 500 tests key resistance: Can bulls push higher?\n\nPretty much what was expected from the Fed—rates held steady at 4.25–4.50%. No surprise, no pivot talk either. Powell stayed on script: inflation is improving, but not enough to move yet. He kept it open-ended, data-dependent as...\n\nRead More👈",
    "url": "https://fxstreet.page.link/w1kToB5EG49QwD6T6"
  },
  {
    "message": "Rising wedge and latest decline\n\nS&P 500 tried to push higher, led by tech (which was the area that brought clients‘ very short-term gains yesterday), alongside the dollar that continued consolidating with a bullish bias. The key question brought up in the below caption (and what kind of sectoral consequences that can...\n\nRead More👈",
    "url": "https://fxstreet.page.link/Xue5UyYgNAUZGwYE6"
  },
  {
    "message": "EUR/GBP slips as US–EU trade deal lifts Dollar, BoE cut expected\n\nThe EUR/GBP extended its losses in the early North American session, down over 0.15% as traders digested trading news between the United States (US) and the European Union...\n\nRead More👈",
    "url": "https://fxstreet.page.link/LPTwKe1fNTVTot269"
  },
  {
    "message": "Bank of Canada keeps rate unchanged, warns of possible cut\n\nThe Bank of Canada kept its key rate unchanged at 2.75% for the fourth consecutive...\n\nRead More👈",
    "url": "https://fxstreet.page.link/zV4SqghsEeroSuNn8"
  },
  {
    "message": "GBP/USD outlook: Cable remains under increased pressure\n\nCable fell to the lowest in almost 2 ½ months on Wednesday, extending a steep fall from 1.3588 (July 24 lower top) into fifth straight...\n\nRead More👈",
    "url": "https://fxstreet.page.link/7agxNkJQMWm5uQnp7"
  },
  {
    "message": "Silver Price Forecast: XAG/USD tests key support at $37.50 ahead of Fed decision\n\nSilver (XAG/USD) drifts lower on Wednesday, hovering around $37.50 after two days of muted, range-bound trading, pressured by renewed strength in the US Dollar (USD). The Greenback extended its rally after a string of stronger-than-expected US economic data, putting pressure on precious...\n\nRead More👈",
    "url": "https://fxstreet.page.link/uPFrhfHYUHvY7aNPA"
  },
  {
    "message": "Silver, Gold, USD: One foot over the verge\n\nThe markets are no longer on the verge – they’re making the key step as I’m writing...\n\nRead More👈",
    "url": "https://fxstreet.page.link/PBXwerGtzpWDDpLN9"
  },
  {
    "message": "Dow Jones Industrial Average treads water ahead of Fed rate call\n\nThe Dow Jones Industrial Average (DJIA) was little changed through the early Wednesday session, trading in a tight circle around 44,600 ahead of the Federal Reserve’s (Fed) latest interest rate...\n\nRead More👈",
    "url": "https://fxstreet.page.link/5gbtUF8Pbyb3Mozs9"
  },
  {
    "message": "How a 36 year bet hints at Britain’s quiet turmoil\n\nA Gilt, set to pay out in 2061, has been hemorrhaging value for much of this year, partly because its payout is dependent on the equivalent of Armageddon in the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/oxG58NtETahSAdWN6"
  },
  {
    "message": "AUD/USD Price Forecast: Bearish momentum picks up pace\n\nThe Australian dollar found itself under renewed pressure on Wednesday, mirroring the weakness seen in other risk-sensitive currencies. In the face of a stronger US Dollar (USD), AUD/USD revisited the key contention zone around 0.6450, hitting new five-week...\n\nRead More👈",
    "url": "https://fxstreet.page.link/pq96qpYj7fx2w3h77"
  },
  {
    "message": "UPS stock drops back to covid lows as Bank of America cuts price target\n\nUnited Parcel Service (UPS) stock sank for the second straight session on Wednesday following poor quarterly earnings results to visit the region below $90 that it hasn't seen since the onset of covid in...\n\nRead More👈",
    "url": "https://fxstreet.page.link/R9wWKHuZGRoXEJiU6"
  },
  {
    "message": "Gold Price Forecast: XAU/USD pierces the $3,300 mark as the Fed looms\n\nGold trades below the $3,300 mark shedding ground on the back of broad US Dollar’s (USD) strength. The Greenback maintained a strong footing ever since the week started, helped by encouraging headlines related to trade...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/gold-price-forecast-xau-usd-pierces-the-3-300-mark-as-the-fed-looms-202507301654?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Bank of Canada holds rates steady while signaling easing bias\n\nThe Bank of Canada (BoC) held its policy rate steady at 2.75% at today's announcement, an outcome that was widely expected, and the third straight meeting at which the central bank has left policy...\n\nRead More👈",
    "url": "https://fxstreet.page.link/d9eZLDT5zDtT2r726"
  },
  {
    "message": "Breaking: Federal Reserve maintains its rates at 4.25%-4.50%\n\nAt its July policy meeting, the Federal Reserve held the Federal Funds Target Range (FFTR) steady at 4.25%–4.50%, exactly as markets had...\n\nRead More👈",
    "url": "https://fxstreet.page.link/HfGw7WQKhoPXLm7f8"
  },
  {
    "message": "US Dollar Index see a slight softening after Fed stands pat on rates once again\n\nThe US Dollar Index (DXY) jittered on Wednesday following the Federal Reserve's (Fed) latest interest rate hold. The Fed's main reference rate remains steady at 4.25-4.5%, as many market participants...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/us-dollar-index-see-a-slight-softening-after-fed-stands-pat-on-rates-once-again-202507301813?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "EUR/USD slumps as Fed holds rates; Waller and Bowman dissent\n\nThe EUR/USD extended its losses during the North American session, as the Federal Open Market Committee (FOMC) held rates unchanged, in a vote split, that witnessed two Governors, favoring a 25-bps rate cut.  At the time of writing, the pair trades volatile at around 1.1475-1.1500, negative on the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/jnWsMzeBmHYddqyu5"
  },
  {
    "message": "AUD/USD tumbles as Fed keeps rates in check, Powell on the spotlight\n\nThe AUD/USD plunges on Wednesday, extending its agony for fourth straight days after the Federal Reserve (Fed) decision to hold rates, thought not unanimously as two officials Waller and Bowman, who telegraphed their intentions before the blackout period, dissented and voted for a 25 bps rate...\n\nRead More👈",
    "url": "https://fxstreet.page.link/cmU66isjUJsJ7bHF6"
  },
  {
    "message": "EUR/USD Price Forecast: Downside has further legs to go\n\nEUR/USD tumbled into the 1.1430–1.1420 zone on Wednesday, marking multi‑week lows as broad‑based US Dollar (USD) strength drove the US Dollar Index well past the 99.00...\n\nRead More👈",
    "url": "https://www.fxstreet.com/analysis/eur-usd-price-forecast-downside-has-further-legs-to-go-202507301858?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Forex Today: No changes expected at the BoJ meeting\n\nThe US Dollar (USD) rose to new multi-week tops underpinned by firmer results from US fundamentals and the upbeat tone from Chair Powell at his press conference after the Federal Reserve left its interest rates the same, as largely...\n\nRead More👈",
    "url": "https://fxstreet.page.link/XYTCqrh3GoJ7qen19"
  },
  {
    "message": "USD/JPY soars to 3-month high as Powell dials down September cut bets\n\nThe USD/JPY rallies over 0.60% after the Federal Reserve held interest rates unchanged and as Fed Chair Jerome Powell, turned slightly hawkish and muted for a September rate cut. The pair trades at 149.38, refreshing three-month...\n\nRead More👈",
    "url": "https://www.fxstreet.com/news/usd-jpy-soars-to-3-month-high-as-powell-dials-down-september-cut-bets-202507301959?utm_source=telegram&utm_medium=channel&utm_campaign=-1001510625232"
  },
  {
    "message": "Canadian Dollar recedes after Fed rate hold\n\nThe Canadian Dollar (CAD) shed further weight against the US Dollar (USD) on Wednesday, with Loonie flows further hobbled by a broad-market step back into the safe haven...\n\nRead More👈",
    "url": "https://fxstreet.page.link/PnQvaiYHtXSaLrv49"
  },
  {
    "message": "Microsoft stock spikes 7% to new all-time high after serving up big beat\n\nMicrosoft (MSFT) stock surged 6.3% afterhours on Wednesday after the software and cloud giant racked up another major quarterly beat. Microsoft stock jumped from its close above $513 to above $545 on the...\n\nRead More👈",
    "url": "https://fxstreet.page.link/TtQD1MECzK5KXpvNA"
  },
  {
    "message": "The Fed continues to kick the can down the road\n\nThe Fed left the key rate unchanged and demonstrated a hawkish tone, forcing the markets to once again postpone the date of the expected easing. This is despite the first situation in 30 years when two committee members voted in favour of a...\n\nRead More👈",
    "url": "https://fxstreet.page.link/N6r9hfpGX7iqg4v9A"
  }
]